#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.Team_Creation.github_branch_protection_v3.example will be created
  + resource "github_branch_protection_v3" "example" {
      + branch                 = "main"
      + enforce_admins         = false
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "Test123"
      + require_signed_commits = false

      + restrictions {}
    }

  # module.Team_Creation.github_membership.membership_for_some_user[0] will be created
  + resource "github_membership" "membership_for_some_user" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "skhedim"
    }

  # module.Team_Creation.github_repository.REPO will be created
  + resource "github_repository" "REPO" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Repository de test"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "Test123"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.Team_Creation.github_repository_collaborator.repo_collaborators[0] will be created
  + resource "github_repository_collaborator" "repo_collaborators" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = (known after apply)
      + username                    = "skhedim"
    }

  # module.Team_Creation.github_repository_collaborator.repo_collaborators[1] will be created
  + resource "github_repository_collaborator" "repo_collaborators" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = (known after apply)
      + username                    = "Salombo"
    }

  # module.Team_Creation.github_team.main[0] will be created
  + resource "github_team" "main" {
      + create_default_maintainer = false
      + description               = "La team 3"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "TEAM3123"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.Team_Creation.github_team_membership.some_team_membership["0.0"] will be created
  + resource "github_team_membership" "some_team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "skhedim"
    }

  # module.Team_Creation.github_team_membership.some_team_membership["0.1"] will be created
  + resource "github_team_membership" "some_team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Salombo"
    }

  # module.Team_Creation.github_team_repository.some_team_repo[0] will be created
  + resource "github_team_repository" "some_team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "Test123"
      + team_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @Salombo, Action: `pull_request`*